ExprovipFuel/src/DataProcessors/ОбменССайтом/ОбменССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменССайтом</name>
  <attributes>
    <name>ВариантОбменаССайтом</name>
    <type>
      <types>EnumRef.ВариантыОбменаССайтом</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ExprovipFuel/src/Enums/ВариантыОбменаССайтом/ВариантыОбменаССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбменаССайтом</name>
  <enumValues>
    <name>ПапкаНаДиске</name>
  </enumValues>
  <enumValues>
    <name>API</name>
  </enumValues>
</mdclass:Enum>

ExprovipFuel/src/DataProcessors/ОбменССайтом/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОбменаССайтомПриИзменении(Элемент)
	УстановитьДоступность();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыгрузитьТранзакции(Команда)
	ВыгрузитьТранзакцииНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка транзакций завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФактуры(Команда)
	ВыгрузитьФактурыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка фактур завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКлиентов(Команда)
	ВыгрузитьКлиентовНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка пользователей завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОплаты(Команда)
	ВыгрузитьОплатыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка оплат завершена");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьТранзакцииНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьТранзакции(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФактурыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьФактуры(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания, Объект.ВариантОбменаССайтом);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКлиентовНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьКлиентов(Объект.ВариантОбменаССайтом);	
КонецПроцедуры	

&НаСервере
Процедура ВыгрузитьОплатыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьОплаты(
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания,
	 	Объект.ВариантОбменаССайтом);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	ДоступностьЭлемента = Истина;
	Если Объект.ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
		ДоступностьЭлемента = Ложь;
	КонецЕсли;
	Элементы.ВыгрузитьТранзакции.Доступность = ДоступностьЭлемента;
КонецПроцедуры		

#КонецОбласти
